LEXICON_RU: dict[str, str] = {
    '/start': 'Привет! Я бот игры "Камень-ножницы-бумага" !\n\n'
              'Не знаете правила? Отправить команду /help\n'
              'Готовы к игре? Нажмите /play\n'
              'Посмотреть статистику /stat\n',
    '/help': 'Правила игры очень просты:\n'
             ' \n'
             '🗿 побеждает ✂️ (камень затупляет ножницы).\n'
             '✂️ побеждают 📄 (ножницы режут бумагу).\n'
             '📄 побеждает 🗿 (бумага заворачивает камень).\n',
    '/play': 'Сделайте свой выбор!\n',
    'no_echo': 'Данный тип апдейтов не поддерживается '
               'методом send_copy',
    'something': 'Кнопочки видишь? Нажимай! Не видишь? Жми /start',
    'you_win': 'Вы победили',
    'comp_win': 'Компьютер победил',
    'draw': 'Ничья',
    'bet_info': "Вы: {user_choice} | Комьютер: {computer_choice}"
}
