DEFAULT_TEXT = 'Text Not Found'

LEXICON: dict[str, str] = {
    'forward': '>>',
    'backward': '<<',
    '/start': 'Ты точно уверен, что хочешь прочитать эту книгу?\n\n'
              'Чтобы посмотреть список доступных команд - набери /help',
    '/help': '<b>Это бот-читалка</b>\n\nДоступные команды:\n\n/beginning - '
             'перейти в начало книги\n/continue - продолжить '
             'чтение\n/bookmarks - посмотреть список закладок\n/help - '
             'справка по работе бота\n\nЧтобы сохранить закладку - '
             'нажмите на кнопку с номером страницы\n\n<b>Приятного чтения!</b>',
    '/bookmarks': '<b>Это список ваших закладок:</b>',
    'added_bookmarks': 'Страница добавлена в закладки!',
    'edit_bookmarks': '<b>Редактировать закладки</b>',
    'edit_bookmarks_button': '❌ РЕДАКТИРОВАТЬ',
    'del': '❌',
    'cancel': 'ОТМЕНИТЬ',
    'no_bookmarks': 'У вас пока нет ни одной закладки.\n\nЧтобы '
                    'добавить страницу в закладки - во время чтения '
                    'книги нажмите на кнопку с номером этой '
                    'страницы\n\n/continue - продолжить чтение',
    'cancel_text': '/continue - продолжить чтение',
    'first_page': 'Вы на первой странице книги',
    'last_page': 'Вы на последней странице книги',
    'something': 'Если ты в меньшинстве – и даже в единственном числе, – это не значит, что ты безумен. Есть правда и '
                 'есть неправда, и, если ты держишься правды, пусть наперекор всему свету, ты не безумен.'
}

LEXICON_COMMANDS: dict[str, str] = {
    '/beginning': 'В начало книги',
    '/continue': 'Продолжить чтение',
    '/bookmarks': 'Мои закладки',
    '/help': 'Справка по работе бота'
}